#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Target                0   xyzw        0   TARGET   float   xyzw
;
; shader debug name: f5ebdf9c26c79cad3a08df7614528c3d.pdb
; shader hash: f5ebdf9c26c79cad3a08df7614528c3d
;
; Pipeline Runtime Information: 
;
; Pixel Shader
; DepthOutput=0
; SampleFrequency=0
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       
; COLOR                    0                 linear       
; TEXCOORD                 0                 linear       
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Target                0                              
;
; Buffer Definitions:
;
;
; Resource Bindings:
;

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, subprograms: !3, globals: !39)
!1 = !DIFile(filename: "SamplePixelShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DISubprogram(name: "main", scope: !1, file: !1, line: 14, type: !5, isLocal: false, isDefinition: true, scopeLine: 15, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!5 = !DISubroutineType(types: !6)
!6 = !{!7, !19}
!7 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !8)
!8 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !9, templateParams: !15)
!9 = !{!10, !12, !13, !14}
!10 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !8, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!11 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !8, file: !1, baseType: !11, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!15 = !{!16, !17}
!16 = !DITemplateTypeParameter(name: "element", type: !11)
!17 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 4)
!18 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !1, line: 6, size: 288, align: 32, elements: !20)
!20 = !{!21, !22, !31}
!21 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !19, file: !1, line: 8, baseType: !7, size: 128, align: 32)
!22 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !19, file: !1, line: 9, baseType: !23, size: 96, align: 32, offset: 128)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !24)
!24 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !25, templateParams: !29)
!25 = !{!26, !27, !28}
!26 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !24, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !24, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !24, file: !1, baseType: !11, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!29 = !{!16, !30}
!30 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 3)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !19, file: !1, line: 10, baseType: !32, size: 64, align: 32, offset: 224)
!32 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !33)
!33 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !34, templateParams: !37)
!34 = !{!35, !36}
!35 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !33, file: !1, baseType: !11, size: 32, align: 32, flags: DIFlagPublic)
!36 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !33, file: !1, baseType: !11, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!37 = !{!16, !38}
!38 = !DITemplateValueParameter(name: "element_count", type: !18, value: i32 2)
!39 = !{!40, !44, !46}
!40 = !DIGlobalVariable(name: "g_texture", linkageName: "\01?g_texture@@3V?$Texture2D@V?$vector@M$03@@@@A", scope: !0, file: !1, line: 1, type: !41, isLocal: false, isDefinition: true, variable: %"class.Texture2D<vector<float, 4> >"* @"\01?g_texture@@3V?$Texture2D@V?$vector@M$03@@@@A")
!41 = !DICompositeType(tag: DW_TAG_class_type, name: "Texture2D<vector<float, 4> >", file: !1, line: 1, size: 160, align: 32, elements: !2, templateParams: !42)
!42 = !{!43}
!43 = !DITemplateTypeParameter(name: "element", type: !8)
!44 = !DIGlobalVariable(name: "g_sampler", linkageName: "\01?g_sampler@@3USamplerState@@A", scope: !0, file: !1, line: 2, type: !45, isLocal: false, isDefinition: true, variable: %struct.SamplerState* @"\01?g_sampler@@3USamplerState@@A")
!45 = !DICompositeType(tag: DW_TAG_structure_type, name: "SamplerState", file: !1, line: 2, size: 32, align: 32, elements: !2)
!46 = !DIGlobalVariable(name: "g_feedbackMap", linkageName: "\01?g_feedbackMap@@3V?$FeedbackTexture2D@$0A@@@A", scope: !0, file: !1, line: 3, type: !47, isLocal: false, isDefinition: true, variable: %"class.FeedbackTexture2D<0>"* @"\01?g_feedbackMap@@3V?$FeedbackTexture2D@$0A@@@A")
!47 = !DICompositeType(tag: DW_TAG_class_type, name: "FeedbackTexture2D<0>", file: !1, line: 3, size: 32, align: 32, elements: !2, templateParams: !48)
!48 = !{!49}
!49 = !DITemplateValueParameter(name: "kind", type: !50, value: i32 0)
!50 = !DIBasicType(name: "unsigned int", size: 32, align: 32, encoding: DW_ATE_unsigned)
!51 = !{i32 2, !"Dwarf Version", i32 4}
!52 = !{i32 2, !"Debug Info Version", i32 3}
!53 = !{!"dxc 1.2"}
!54 = !{!"SamplePixelShader.hlsl", !"Texture2D g_texture : register(t0);\0ASamplerState g_sampler : register(s0);\0AFeedbackTexture2D<SAMPLER_FEEDBACK_MIN_MIP> g_feedbackMap : register(u0);\0A\0A// Per-pixel color data passed through the pixel shader.\0Astruct PixelShaderInput\0A{\0A\09float4 pos : SV_POSITION;\0A\09float3 color : COLOR0;\0A\09float2 uv : TEXCOORD;\0A};\0A\0A// A pass-through function for the (interpolated) color data.\0Afloat4 main(PixelShaderInput input) : SV_TARGET\0A{\0A\09//g_feedbackMap.WriteSamplerFeedback(g_texture, g_sampler, input.uv);\0A\09//g_feedbackMap.WriteSamplerFeedbackLevel(g_texture, g_sampler, input.uv, 0);\0A\09g_feedbackMap.WriteSamplerFeedbackBias(g_texture, g_sampler, input.uv, 2);\0A\0A\09return g_texture.Sample(g_sampler, input.uv);\0A}\0A"}
!55 = !{!"SamplePixelShader.hlsl"}
!56 = !{!"/Zi", !"-Od", !"-Qembed_debug", !"-T", !"ps_6_5", !"-E", !"main"}
!57 = !{i32 1, i32 5}
!58 = !{!"ps", i32 6, i32 5}
!59 = !{!60, !63, null, !66}
!60 = !{!61}
!61 = !{i32 0, %"class.Texture2D<vector<float, 4> >"* undef, !"g_texture", i32 0, i32 0, i32 1, i32 2, i32 0, !62}
!62 = !{i32 0, i32 9}
!63 = !{!64}
!64 = !{i32 0, %"class.FeedbackTexture2D<0>"* undef, !"g_feedbackMap", i32 0, i32 0, i32 1, i32 17, i1 false, i1 false, i1 false, !65}
!65 = !{i32 2, i32 0}
!66 = !{!67}
!67 = !{i32 0, %struct.SamplerState* undef, !"g_sampler", i32 0, i32 0, i32 1, i32 0, null}
!68 = !{i32 0, %"class.Texture2D<vector<float, 4> >" undef, !69, %"class.Texture2D<vector<float, 4> >::mips_type" undef, !75, %"class.FeedbackTexture2D<0>" undef, !77, %struct.PixelShaderInput undef, !82}
!69 = !{i32 20, !70, !71, !72}
!70 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 9}
!71 = !{i32 6, !"mips", i32 3, i32 16}
!72 = !{i32 0, !73}
!73 = !{!74}
!74 = !{i32 0, <4 x float> undef}
!75 = !{i32 4, !76}
!76 = !{i32 6, !"handle", i32 3, i32 0, i32 7, i32 5}
!77 = !{i32 4, !78, !79}
!78 = !{i32 6, !"h", i32 3, i32 0, i32 7, i32 5}
!79 = !{i32 0, !80}
!80 = !{!81}
!81 = !{i32 1, i64 0}
!82 = !{i32 40, !83, !84, !85}
!83 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
