#if 0
;
; Input signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; POSITION                 0   xyz         0     NONE   float   xyz 
; COLOR                    0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
;
; Output signature:
;
; Name                 Index   Mask Register SysValue  Format   Used
; -------------------- ----- ------ -------- -------- ------- ------
; SV_Position              0   xyzw        0      POS   float   xyzw
; COLOR                    0   xyz         1     NONE   float   xyz 
; TEXCOORD                 0   xy          2     NONE   float   xy  
;
; shader debug name: 3451ea84d309e1ad8b4373a5f7c6ce47.pdb
; shader hash: 3451ea84d309e1ad8b4373a5f7c6ce47
;
; Pipeline Runtime Information: 
;
; Vertex Shader
; OutputPositionPresent=1
;
;
; Input signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; POSITION                 0                              
; COLOR                    0                              
; TEXCOORD                 0                              
;
; Output signature:
;
; Name                 Index             InterpMode DynIdx
; -------------------- ----- ---------------------- ------
; SV_Position              0          noperspective       

!0 = distinct !DICompileUnit(language: DW_LANG_C_plus_plus, file: !1, producer: "dxc 1.2", isOptimized: false, runtimeVersion: 0, emissionKind: 1, enums: !2, retainedTypes: !3, subprograms: !16)
!1 = !DIFile(filename: "SampleVertexShader.hlsl", directory: "")
!2 = !{}
!3 = !{!4}
!4 = !DIDerivedType(tag: DW_TAG_typedef, name: "float4", file: !1, baseType: !5)
!5 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 4>", file: !1, size: 128, align: 32, elements: !6, templateParams: !12)
!6 = !{!7, !9, !10, !11}
!7 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !5, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!8 = !DIBasicType(name: "float", size: 32, align: 32, encoding: DW_ATE_float)
!9 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "w", scope: !5, file: !1, baseType: !8, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!12 = !{!13, !14}
!13 = !DITemplateTypeParameter(name: "element", type: !8)
!14 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 4)
!15 = !DIBasicType(name: "int", size: 32, align: 32, encoding: DW_ATE_signed)
!16 = !{!17}
!17 = !DISubprogram(name: "main", scope: !1, file: !1, line: 26, type: !18, isLocal: false, isDefinition: true, scopeLine: 27, flags: DIFlagPrototyped, isOptimized: false, function: void ()* @main)
!18 = !DISubroutineType(types: !19)
!19 = !{!20, !40}
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: "PixelShaderInput", file: !1, line: 18, size: 288, align: 32, elements: !21)
!21 = !{!22, !23, !32}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !20, file: !1, line: 20, baseType: !4, size: 128, align: 32)
!23 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !20, file: !1, line: 21, baseType: !24, size: 96, align: 32, offset: 128)
!24 = !DIDerivedType(tag: DW_TAG_typedef, name: "float3", file: !1, baseType: !25)
!25 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 3>", file: !1, size: 96, align: 32, elements: !26, templateParams: !30)
!26 = !{!27, !28, !29}
!27 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !25, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "z", scope: !25, file: !1, baseType: !8, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!30 = !{!13, !31}
!31 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 3)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !20, file: !1, line: 22, baseType: !33, size: 64, align: 32, offset: 224)
!33 = !DIDerivedType(tag: DW_TAG_typedef, name: "float2", file: !1, baseType: !34)
!34 = !DICompositeType(tag: DW_TAG_class_type, name: "vector<float, 2>", file: !1, size: 64, align: 32, elements: !35, templateParams: !38)
!35 = !{!36, !37}
!36 = !DIDerivedType(tag: DW_TAG_member, name: "x", scope: !34, file: !1, baseType: !8, size: 32, align: 32, flags: DIFlagPublic)
!37 = !DIDerivedType(tag: DW_TAG_member, name: "y", scope: !34, file: !1, baseType: !8, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!38 = !{!13, !39}
!39 = !DITemplateValueParameter(name: "element_count", type: !15, value: i32 2)
!40 = !DICompositeType(tag: DW_TAG_structure_type, name: "VertexShaderInput", file: !1, line: 10, size: 256, align: 32, elements: !41)
!41 = !{!42, !43, !44}
!42 = !DIDerivedType(tag: DW_TAG_member, name: "pos", scope: !40, file: !1, line: 12, baseType: !24, size: 96, align: 32)
!43 = !DIDerivedType(tag: DW_TAG_member, name: "color", scope: !40, file: !1, line: 13, baseType: !24, size: 96, align: 32, offset: 96)
!44 = !DIDerivedType(tag: DW_TAG_member, name: "uv", scope: !40, file: !1, line: 14, baseType: !33, size: 64, align: 32, offset: 192)
!45 = !{i32 2, !"Dwarf Version", i32 4}
!46 = !{i32 2, !"Debug Info Version", i32 3}
!47 = !{!"dxc 1.2"}
!48 = !{!"SampleVertexShader.hlsl", !"// A constant buffer that stores the three basic column-major matrices for composing geometry.\0Acbuffer ModelViewProjectionConstantBuffer : register(b0)\0A{\0A\09matrix model;\0A\09matrix view;\0A\09matrix projection;\0A};\0A\0A// Per-vertex data used as input to the vertex shader.\0Astruct VertexShaderInput\0A{\0A\09float3 pos : POSITION;\0A\09float3 color : COLOR0;\0A\09float2 uv : TEXCOORD;\0A};\0A\0A// Per-pixel color data passed through the pixel shader.\0Astruct PixelShaderInput\0A{\0A\09float4 pos : SV_POSITION;\0A\09float3 color : COLOR0;\0A\09float2 uv : TEXCOORD;\0A};\0A\0A// Simple shader to do vertex processing on the GPU.\0APixelShaderInput main(VertexShaderInput input)\0A{\0A\09PixelShaderInput output;\0A\09float4 pos = float4(input.pos, 1.0f);\0A\0A\09// Transform the vertex position into projected space.\0A\09pos = mul(pos, model);\0A\09pos = mul(pos, view);\0A\09pos = mul(pos, projection);\0A\09output.pos = pos;\0A\0A\09// Pass the color through without modification.\0A\09output.color = input.color;\0A\0A\09output.uv = input.uv;\0A\0A\09return output;\0A}\0A"}
!49 = !{!"SampleVertexShader.hlsl"}
!50 = !{!"/Zi", !"-Od", !"-Qembed_debug", !"-T", !"vs_6_5", !"-E", !"main"}
!51 = !{i32 1, i32 5}
!52 = !{!"vs", i32 6, i32 5}
!53 = !{null, null, !54, null}
!54 = !{!55}
!55 = !{i32 0, %dx.alignment.legacy.ModelViewProjectionConstantBuffer* undef, !"ModelViewProjectionConstantBuffer", i32 0, i32 0, i32 1, i32 192, null}
!56 = !{i32 0, %struct.PixelShaderInput undef, !57, %struct.VertexShaderInput undef, !61, %ModelViewProjectionConstantBuffer undef, !63, %dx.alignment.legacy.ModelViewProjectionConstantBuffer undef, !63}
!57 = !{i32 40, !58, !59, !60}
!58 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"SV_POSITION", i32 7, i32 9}
!59 = !{i32 6, !"color", i32 3, i32 16, i32 4, !"COLOR0", i32 7, i32 9}
!60 = !{i32 6, !"uv", i32 3, i32 32, i32 4, !"TEXCOORD", i32 7, i32 9}
!61 = !{i32 40, !62, !59, !60}
!62 = !{i32 6, !"pos", i32 3, i32 0, i32 4, !"POSITION", i32 7, i32 9}
!63 = !{i32 192, !64, !66, !67}
!64 = !{i32 6, !"model", i32 2, !65, i32 3, i32 0, i32 7, i32 9, i32 9, i1 true}
!65 = !{i32 4, i32 4, i32 2}
!66 = !{i32 6, !"view", i32 2, !65, i32 3, i32 64, i32 7, i32 9, i32 9, i1 true}
!67 = !{i32 6, !"projection", i32 2, !65, i32 3, i32 128, i32 7, i32 9, i32 9, i1 true}
!68 = !{i32 1, void ()* @main, !69}
!69 = !{!70}
!70 = !{i32 0, !2, !2}
!71 = !{[12 x i32] [i32 10, i32 10, i32 15, i32 15, i32 15, i32 0, i32 112, i32 112, i32 112, i32 0, i32 768, i32 768]}
!72 = !{void ()* @main, !"main", !73, !53, !86}
!73 = !{!74, !81, null}
!74 = !{!75, !78, !79}
!75 = !{i32 0, !"POSITION", i8 9, i8 0, !76, i8 0, i32 1, i8 3, i32 0, i8 0, !77}
!76 = !{i32 0}
!77 = !{i32 3, i32 7}
!78 = !{i32 1, !"COLOR", i8 9, i8 0, !76, i8 0, i32 1, i8 3, i32 1, i8 0, !77}
!79 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !76, i8 0, i32 1, i8 2, i32 2, i8 0, !80}
!80 = !{i32 3, i32 3}
!81 = !{!82, !84, !85}
!82 = !{i32 0, !"SV_Position", i8 9, i8 3, !76, i8 4, i32 1, i8 4, i32 0, i8 0, !83}
!83 = !{i32 3, i32 15}
!84 = !{i32 1, !"COLOR", i8 9, i8 0, !76, i8 2, i32 1, i8 3, i32 1, i8 0, !77}
!85 = !{i32 2, !"TEXCOORD", i8 9, i8 0, !76, i8 2, i32 1, i8 2, i32 2, i8 0, !80}
!86 = !{i32 0, i64 1}
!87 = !DILocalVariable(tag: DW_TAG_arg_variable, name: "input", arg: 1, scope: !17, file: !1, line: 26, type: !40)
!88 = !DIExpression(DW_OP_bit_piece, 192, 64)
!89 = !DILocation(line: 26, column: 41, scope: !17)
!90 = !DIExpression(DW_OP_bit_piece, 96, 96)
!91 = !DIExpression(DW_OP_bit_piece, 0, 96)
!92 = !DILocalVariable(tag: DW_TAG_auto_variable, name: "pos", scope: !17, file: !1, line: 29, type: !4)
!93 = !DIExpression()
